FV2504/E_0609.dot
digraph D {
'    labelloc="t";
label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.4.1: AD: Lieferende von NB an LF</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0609</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> LF</B></FONT><BR align="center"/>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Wurde im Geschäftsvorfall angegeben, dass es sich um eine verbrauchende Marktlokation oder ruhende Marktlokation handelt?<BR align="left"/>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Handelt es sich um eine Abmeldung einer Marktlokation, welche aus einer Kundenanlage herausgelöst werden soll?<BR align="left"/>Hinweis: <BR align="left"/>In der Transaktionsgrundergänzung ist „ruhende Marktlokation“ angegeben.<BR align="left"/>>];
    "25" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>25: </B>Handelt es sich bei der im Anwendungsfall genannten Marktlokation um eine „ruhende Marktlokation“ einer Kundenanlage (§ 20 Abs. 1d EnWG oder § 10 c EEG)<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Bei der in der Abmeldung genannten Marktlokation handelt es sich nicht um eine „ruhende Marktlokation“ einer Kundenanlage.<BR align="left"/></FONT>>];
    "27" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>27: </B>Ist die in der Abmeldung als genannte „ruhende Marktlokation“ definierte Marktlokation der in der Abmeldung genannten Marktlokation zugeordnet?<BR align="left"/>>];
    "A30" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A30</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die in der Abmeldung genannte „ruhende Marktlokation“ ist nicht der Marktlokation aus der Abmeldung zugeordnet und kann somit dort nicht herausgelöst werden<BR align="left"/></FONT>>];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>30: </B>Wurde bereits zum identischen Abmeldedatum für die in diesem Geschäftsvorfall genannte Marktlokation die Lieferende-Meldung positiv bestätigt?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Lieferende zum Abmeldedatum wurde bereits bestätigt<BR align="left"/></FONT>>];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>40: </B>Wurde die Vorlauffrist eingehalten?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung:<BR align="left"/>Vorlauffrist wurde nicht eingehalten<BR align="left"/></FONT>>];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>50: </B>Liegt der Transaktionsgrund<BR align="left"/>Auszug wegen Stilllegung<BR align="left"/>vor?<BR align="left"/>>];
    "60" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>60: </B>Liegen dem LF Informationen darüber vor, dass die Marktlokation nicht stillgelegt wird/wurde?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Dem LF liegen Informationen vor, dass die Marktlokation nicht stillgelegt wird/wurde.<BR align="left"/>Hinweis: Die Informationen sind in der Antwort zu beschreiben/benennen.<BR align="left"/></FONT>>];
    "70" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>70: </B>Ist das angegebene Datum „Lieferende“ der nächste 1. eines Kalendermonats 00:00 Uhr?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Das Lieferende muss auf dem 1. eines Kalendermonats 00:00 Uhr liegen.<BR align="left"/></FONT>>];
    "80" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>80: </B>Liegt der Transaktionsgrund Abmeldung wegen fehl. Zuordnungsermächtigung aufgrund Änderung ZRT vor?<BR align="left"/>>];
    "90" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>90: </B>Wurde der Zeitreihentyp an der betreffenden Marktlokation auf einen ZRT geändert, für welchen keine Zuordnungsermächtigung besteht?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Es liegt keine Änderung auf einen Zeitreihentyp vor, für welchen keine Zuordnungsermächtigung besteht. (Zuordnungsermächtigung liegt vor)<BR align="left"/></FONT>>];
    "100" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>100: </B>Hat der BKV die Deaktivierung der Zuordnungsermächtigung für den ZRT, welcher der genannten Marktlokation zugeordnet ist, zum übermittelten Lieferende vorgenommen?<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A07</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Deaktivierung der Zuordnungsermächtigung für den der Marktlokation zugeordneten ZRT hat nicht stattgefunden.<BR align="left"/></FONT>>];
    "110" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>110: </B>Hat die dem Lieferende zugrundeliegende Deaktivierung der Zuordnungsermächtigung ihre Gültigkeit weiter als einen Monat in die Zukunft?<BR align="left"/>>];
    "A08" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A08</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung <BR align="left"/>Frist nicht eingehalten<BR align="left"/></FONT>>];
    "120" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>120: </B>Liegt das Eingangsdatum der Abmeldung nach dem 5. WT des Monats, in dem die Zuordnungsermächtigung endet?<BR align="left"/>>];
    "A09" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A09</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung <BR align="left"/>Fristüberschreitung<BR align="left"/></FONT>>];
    "130" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>130: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A99" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A99</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Sonstiges <BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen. Nutzungsmöglichkeit Ende: 01.04.2026 00:00 Uhr<BR align="left"/></FONT>>];
    "A10" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A10</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Lieferende wird zugestimmt<BR align="left"/></FONT>>];
    "510" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>510: </B>Wurde bereits zum identischen Abmeldedatum für die in diesem Geschäftsvorfall genannte Marktlokation bzw. Tranche die Lieferende-Meldung positiv bestätigt?<BR align="left"/>>];
    "A21" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A21</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Lieferende zum Abmeldedatum wurde bereits bestätigt<BR align="left"/></FONT>>];
    "520" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>520: </B>Wurde die Vorlauffrist eingehalten?<BR align="left"/>>];
    "A22" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A22</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Vorlauffrist wurde nicht eingehalten<BR align="left"/></FONT>>];
    "530" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>530: </B>Liegt der Transaktionsgrund Stilllegung vor?<BR align="left"/>>];
    "540" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>540: </B>Liegen dem LF Informationen darüber vor, dass die Marktlokation bzw. Tranche nicht stillgelegt wird/wurde?<BR align="left"/>>];
    "A23" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A23</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Dem LF liegen Informationen vor, dass die Marktlokation bzw. Tranche nicht stillgelegt wird/wurde.<BR align="left"/>Hinweis: Die Informationen sind in der Antwort zu beschreiben/benennen.<BR align="left"/></FONT>>];
    "550" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>550: </B>Ist das angegebene Datum „Lieferende“ der 1. eines Kalendermonats 00:00 Uhr?<BR align="left"/>>];
    "A24" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A24</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Das Lieferende muss auf dem 1. eines Kalendermonats 00:00 Uhr liegen.<BR align="left"/></FONT>>];
    "560" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>560: </B>Liegt der Transaktionsgrund Abmeldung wegen fehl. Zuordnungsermächtigung aufgrund Änderung ZRT vor?<BR align="left"/>>];
    "570" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>570: </B>Wurde der Zeitreihentyp an der betreffenden Marktlokation bzw. Tranche auf einen ZRT geändert, für welchen keine Zuordnungsermächtigung besteht?<BR align="left"/>>];
    "A25" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A25</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Es liegt keine Änderung auf einen Zeitreihentyp vor, für welchen keine Zuordnungsermächtigung besteht. (Zuordnungsermächtigung liegt vor)<BR align="left"/></FONT>>];
    "580" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>580: </B>Hat der BKV die Deaktivierung der Zuordnungsermächtigung für den ZRT, welcher der genannten Marktlokation bzw. Tranche zugeordnet ist, zum übermittelten Lieferende vorgenommen?<BR align="left"/>>];
    "A26" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A26</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Deaktivierung der Zuordnungsermächtigung für den der Marktlokation bzw. Tranche zugeordneten ZRT hat nicht stattgefunden.<BR align="left"/></FONT>>];
    "590" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>590: </B>Hat die dem Lieferende zugrundeliegende Deaktivierung der Zuordnungsermächtigung ihre Gültigkeit weiter als einen Monat in die Zukunft?<BR align="left"/>>];
    "A27" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A27</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung <BR align="left"/>Frist nicht eingehalten<BR align="left"/></FONT>>];
    "600" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>600: </B>Liegt das Eingangsdatum der Abmeldung nach dem 5. WT des Monats, in dem die Zuordnungsermächtigung endet?<BR align="left"/>>];
    "A28" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A28</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung <BR align="left"/>Fristüberschreitung<BR align="left"/></FONT>>];
    "610" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>610: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>];
    "A29" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A29</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Lieferende wird zugestimmt<BR align="left"/></FONT>>];

    "Start" -> "10";
    "10" -> "20" [label="Ja"];
    "10" -> "510" [label="Nein"];
    "20" -> "25" [label="Ja"];
    "20" -> "30" [label="Nein"];
    "25" -> "A01" [label="Nein"];
    "25" -> "27" [label="Ja"];
    "27" -> "A30" [label="Nein"];
    "27" -> "30" [label="Ja"];
    "30" -> "A02" [label="Ja"];
    "30" -> "40" [label="Nein"];
    "40" -> "A03" [label="Nein"];
    "40" -> "50" [label="Ja"];
    "50" -> "60" [label="Ja"];
    "50" -> "70" [label="Nein"];
    "60" -> "A04" [label="Ja"];
    "60" -> "130" [label="Nein"];
    "70" -> "A05" [label="Nein"];
    "70" -> "80" [label="Ja"];
    "80" -> "90" [label="Ja"];
    "80" -> "100" [label="Nein"];
    "90" -> "A06" [label="Nein"];
    "90" -> "130" [label="Ja"];
    "100" -> "A07" [label="Nein"];
    "100" -> "110" [label="Ja"];
    "110" -> "A08" [label="Ja"];
    "110" -> "120" [label="Nein"];
    "120" -> "A09" [label="Ja"];
    "120" -> "130" [label="Nein"];
    "130" -> "A99" [label="Ja"];
    "130" -> "A10" [label="Nein"];
    "510" -> "A21" [label="Ja"];
    "510" -> "520" [label="Nein"];
    "520" -> "A22" [label="Nein"];
    "520" -> "530" [label="Ja"];
    "530" -> "540" [label="Ja"];
    "530" -> "550" [label="Nein"];
    "540" -> "A23" [label="Ja"];
    "540" -> "610" [label="Nein"];
    "550" -> "A24" [label="Nein"];
    "550" -> "560" [label="Ja"];
    "560" -> "570" [label="Ja"];
    "560" -> "580" [label="Nein"];
    "570" -> "A25" [label="Nein"];
    "570" -> "610" [label="Ja"];
    "580" -> "A26" [label="Nein"];
    "580" -> "590" [label="Ja"];
    "590" -> "A27" [label="Ja"];
    "590" -> "600" [label="Nein"];
    "600" -> "A28" [label="Ja"];
    "600" -> "610" [label="Nein"];
    "610" -> "A99" [label="Ja"];
    "610" -> "A29" [label="Nein"];

    bgcolor="transparent";
}
